import sys
name = sys.argv[1:]
print(name[0:3])

"""
ПЕРВАЯ ТРОЙКА
Напишите программу, 
которая принимает из аргументов командной строки список спортсменов, 
а затем выводит первую тройку.

Пример использования:
> python program.py Ильин Петров Зинько Сидоров Васильев Литвинов
> ['Ильин', 'Петров', 'Зинько']
"""